[
    {
        "id": 1,
        "title": "What is a context API?",
        "img": "https://images.unsplash.com/photo-1589965485308-0d564ef92e26?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
        "blog": "In JavaScript REACT when we want to send data from a parent component to a child component we usually use props. But When we talk about a complex situation where we need to pass data through the multi-level component by using props it would be very difficult. To bring the solution to this problem came the 'CONTEXT API'. In this method first, we declare a JavaScript REACT hook named 'useContext' then we put all the child where we need to pass data on the 'CONTEXT' state. Then we pass data by using Provider . After all, we can easily access that passed data from any child where the level doesn't  Matter. "
    },
    {
        "id": 2,
        "title": "What is Semantic tag in HTML?",
        "img": "https://images.unsplash.com/photo-1581555866321-708b05cb9b4d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
        "blog": "According to the Oxford dictionary, the word 'semantic' means relating to meaning in language or logic. By the name Semantic tag, we can easily understand it is a tag that it is tag that has meaning full name relating with its works. The HTML semantics refers to the tags that provide meaning to an HTML page rather than just presentation. From the last version of HTML  'HTML 5', the semantic tags have come to us. Before it came we use some common tags for various purposes. For that, the developer could be confused. As the solution, semantic tags have been revealed that have a meaningful name with the using purose."
    },
    {
        "id": 3,
        "title": "What are the differences between inline and block elements?",
        "img": "https://images.unsplash.com/photo-1612529377282-e6c1d5fe7695?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=387&q=80",
        "blog": "Convenient location - only 15 mins from the Mosque. Excellent modern facilities. Nice simple elegant layout with steelwork reflecting date palm trees. Convenient location of cafetarias, toilets and prayer rooms. Friendly staff and security personnel. Clean and tidy. Ample seating facilities"
    }
]